# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного
# максимума)

# Ввод: [-5, 9, 0, 3, -1, -2, 1,
# 4, -2, 10, 2, 0, -9, 8, 10, -9,
# 0, -5, -5, 7]

# Вывод: [1, 9, 13, 14, 19]
#

list_1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]

min_el = 7
max_el = 10

#for i in list_1:
#    if (i >= min_el) and (i <= max_el):
#        print(list_1.index(i))

ind = [i for i in range(len(list_1)) if (list_1[i] >= min_el) and (list_1[i] <= max_el)]
print(ind)

