# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

print("Введите число N: ")
n = int(input())
stepen = 2
k = 2

while stepen <= n:
    print(stepen)
    stepen = stepen * k




